In [14]:
import matplotlib.pyplot as plt
import pandas as pd

In [15]:
df = pd.read_csv("../data/processed/churn_cleaned.csv")

In [16]:
df.columns

Index(['CustomerID', 'Age', 'Gender', 'Tenure', 'MonthlyCharges',
       'ContractType', 'InternetService', 'TotalCharges', 'TechSupport',
       'Churn'],
      dtype='object')

In [17]:
df.head(1)

,CustomerID,Age,Gender,Tenure,MonthlyCharges,ContractType,InternetService,TotalCharges,TechSupport,Churn
0,1,49,Male,4,88.35,Month-to-Month,Fiber Optic,353.4,Yes,Yes

In [18]:
y = df[["Churn"]].copy()
X = df[["Age","Gender","Tenure","MonthlyCharges"]].copy()

 1 for female and 0 for male

In [19]:
X

     Age  Gender  Tenure  MonthlyCharges
0     49    Male       4           88.35
1     43    Male       0           36.67
2     51  Female       2           63.79
3     60  Female       8          102.34
4     42    Male      32           69.01
..   ...     ...     ...             ...
995   42    Male      41           37.14
996   62    Male       9           80.93
997   51  Female      15          111.72
998   39    Male      68           65.67
999   50    Male       1           56.67

[1000 rows x 4 columns]

In [20]:
X["Gender"] = X["Gender"].apply(lambda x:1 if x == "Female" else 0)

In [21]:
y

    Churn
0     Yes
1     Yes
2     Yes
3     Yes
4     Yes
..    ...
995   Yes
996   Yes
997   Yes
998   Yes
999   Yes

[1000 rows x 1 columns]

In [22]:
X.head()

   Age  Gender  Tenure  MonthlyCharges
0   49       0       4           88.35
1   43       0       0           36.67
2   51       1       2           63.79
3   60       1       8          102.34
4   42       0      32           69.01

In [23]:
type(X["Gender"][0])

numpy.int64

In [24]:
y["Churn"] = y["Churn"].apply(lambda x:1 if x == "Yes" else 0)

In [25]:
y["Churn"][0]

np.int64(1)

In [26]:
# Save X and y separately
X.to_csv("../data/processed/X.csv", index=False)
y.to_csv("../data/processed/y.csv", index=False)